docs/progress-reports/progress-report-6-24-18.tex
% Created 2018-06-24 Sun 20:47
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fontspec}
\setmainfont[BoldFont={Gentium Basic Bold}, ItalicFont={Gentium Basic Italic}]{Gentium Plus}
\usepackage{polyglossia}
\setmainlanguage{english}
\setotherlanguage{hebrew}
\newfontfamily\hebrewfont{SBL Hebrew}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\tableofcontents


\section{Summary of progress that has been made}
\label{sec:org9321430}

This week has been incredibly busy for me for a variety of reasons. My programming summer class really picked up (we got to C/C++ pointers and system calls and have our first test tomorrow), and I had responsibilities related to my living situation that I had to attend to. Not that these are particularly good justifications for not getting sufficient progress made, but here we are.

I restructured the outline according to much of what we talked about, and then copied it over to the draft folder and started hammering away. This first pass at the draft I'm probably going to forgo putting in all the references and formatting everything nicely. There are still many Todos, and lots to be written. Just getting things down on paper is the first priority.

I also got footnotes working. Which took a little bit longer than I thought it might.

\section{Summary of short term goals}
\label{sec:org8c797bf}

I want to get a full draft of the paper down in the next two weeks since I have my first presentation practice on the 19th of July. It doesn't have to be beautiful, but it needs to be mostly thought through.

In the next week, I'd like to implement proper modifier behavior regardless of language layer and the leader-prefixed accents (in English mode) and punctuation (in a language mode) that we've talked about. After these, the program should be ready for basic beta testing.

I'd also like to finish everything up to and including basic reasoning for the Hebrew layer in the paper. That's a little more than halfway. Since my class should back off a bit after this test, hopefully I'll have more time in the coming week to make some good progress.
\end{document}
